export const types =[
  {
    id: "482917364520",
    name: "Тип 1. Запись голоса пользователя",
    title: "Тип 1",
    children: [
      {
        id: "482917364521",
        name: "Тип 1.0. Вопрос по медиа - запись голоса",
        title: "Тип 1.0",
        type:"1.0"
      },
      {
        id: "482917364522",
        name: "Тип 1.1. Волшебный сундучок - запись голоса",
        title: "Тип 1.1",
        type:"1.1"
      },
      {
        id: "482917364523",
        name: "Тип 1.2. Колесо фортуны - запись голоса",
        title: "Тип 1.2",
        type:"1.2"
      },
      {
        id: "482917364523",
        name: "Тип 1.3. Предмет высвечивается - запись голоса",
        title: "Тип 1.3",
        type:"1.3"
      },
      {
        id: "482917364523",
        name: "Тип 1.4. Сразу 2 вопроса из динамика - запись голоса",
        title: "Тип 1.4",
        type:"1.4"
      },
      {
        id: "482917364523",
        name: "Тип 1.5. Ответить на диалог - запись голоса",
        title: "Тип 1.5",
        type:"1.5"
      },
    ],
  },
  {
    id: "193847265019",
    name: "Тип 2. Выбор ответа из вариантов",
    title: "Тип 2",
  },
  {
    id: "857392614380",
    name: "Тип 3. Перетащить ответ на медиа",
    title: "Тип 3",
  },
  {
    id: "604182739561",
    name: "Тип 4. Переворачивать карточки, чтобы найти смежные варианты",
    title: "Тип 4",
  },
  {
    id: "729305184672",
    name: "Тип 5. Соединить правильные пары",
    title: "Тип 5",
  },
];
