export const types = [
  {
    name: "Тип 1. Запись голоса пользователя",
    title: "Тип 1",
    lesson: 1,
    children: [
      {
        name: "Тип 1.0. Вопрос по медиа - запись голоса",
        title: "Тип 1.0",
        type: "1",
      },
      {
        name: "Тип 1.1. Волшебный сундучок - запись голоса",
        title: "Тип 1.1",
        type: "1_1",
      },
      {
        name: "Тип 1.2. Колесо фортуны - запись голоса",
        title: "Тип 1.2",
        type: "1_2",
      },
      {
        name: "Тип 1.3. Предмет высвечивается - запись голоса",
        title: "Тип 1.3",
        type: "1_3",
      },
      {
        name: "Тип 1.4. Сразу 2 вопроса из динамика - запись голоса",
        title: "Тип 1.4",
        type: "1_4",
      },
      {
        name: "Тип 1.5. Ответить на диалог - запись голоса",
        title: "Тип 1.5",
        type: "1_5",
      },
    ],
  },
  {
    name: "Тип 2. Выбор ответа из вариантов",
    title: "Тип 2",
    lesson: 2,
    children: [
      {
        name: "Тип 2.0. Вопрос по медиа - выбрать ответ",
        title: "Тип 2.0",
        type: "2",
      },
      {
        name: "Тип 2.1. Силуэт - выбрать ответ",
        title: "Тип 2.1",
        type: "2_1",
      },
      {
        name: "Тип 2.2. Контурный рисунок - выбрать ответ",
        title: "Тип 2.2",
        type: "2_2",
      },
      {
        name: "Тип 2.3. Вопрос из динамика - выбрать ответ",
        title: "Тип 2.3",
        type: "2_3",
      },
      {
        name: "Тип 2.4. Ответить на диалог - выбрать ответ",
        title: "Тип 2.4",
        type: "2_4",
      },
    ],
  },
  {
    name: "Тип 3. Перетащить ответ на медиа",
    title: "Тип 3",
    lesson: 3,
    children: [
      {
        name: "Тип 3.0. Вопрос по медиа - перетащить ответ",
        title: "Тип 3.0",
        type: "3",
      },
      {
        name: "Тип 3.1. Составить диалог - перетащить ответ",
        title: "Тип 3.1",
        type: "3_1",
      },
      {
        name: "Тип 3.2. Картинка / Анимация персонажей составить диалог - перетащить ответ",
        title: "Тип 3.2",
        type: "3_2",
      },
    ],
  },
  {
    name: "Тип 4. Переворачивать карточки, чтобы найти смежные варианты",
    title: "Тип 4",
    lesson: 4,
    children: [
      {
        name: "Тип 4.0. Переворачивать карточки, чтобы найти смежные варианты",
        title: "Тип 4.0",
        type: "4",
      },
    ],
  },
  {
    name: "Тип 5. Соединить правильные пары",
    title: "Тип 5",
    lesson: 5,
    children: [
      {
        name: "Тип 5.0. Соединить правильные пары",
        title: "Тип 5.0",
        type: "5",
      },
    ],
  },
];
