import MediaVideo from "../../assets/video/video.mp4";

export const types = [
  {
    id: "482917364520",
    name: "Тип 1. Запись голоса пользователя",
    title: "Тип 1",
    lesson: 1,
    game: {
      greeting: true,
    },
    children: [
      {
        id: "482917364521",
        name: "Тип 1.0. Вопрос по медиа - запись голоса",
        title: "Тип 1.0",
        type: "1.0",
        video: {
          one: MediaVideo,
          two: "https://random-video-two.vercel.app/cdn_video.mp4",
        },
      },
      {
        id: "482917364522",
        name: "Тип 1.1. Волшебный сундучок - запись голоса",
        title: "Тип 1.1",
        type: "1.1",
        video: { one: "", two: "" },
      },
      {
        id: "482917364523",
        name: "Тип 1.2. Колесо фортуны - запись голоса",
        title: "Тип 1.2",
        type: "1.2",
        video: { one: "", two: "" },
      },
      {
        id: "482917364524",
        name: "Тип 1.3. Предмет высвечивается - запись голоса",
        title: "Тип 1.3",
        type: "1.3",
        video: { one: "", two: "" },
      },
      {
        id: "482917364525",
        name: "Тип 1.4. Сразу 2 вопроса из динамика - запись голоса",
        title: "Тип 1.4",
        type: "1.4",
        video: { one: "", two: "" },
      },
      {
        id: "482917364526",
        name: "Тип 1.5. Ответить на диалог - запись голоса",
        title: "Тип 1.5",
        type: "1.5",
        video: { one: "", two: "" },
      },
    ],
  },
  {
    id: "193847265019",
    name: "Тип 2. Выбор ответа из вариантов",
    title: "Тип 2",
    lesson: 2,
    children: [
      {
        id: "482917364534",
        name: "Тип 2.0. Вопрос по медиа - выбрать ответ",
        title: "Тип 2.0",
        type: "2.0",
        video: { one: "", two: "" },
      },
      {
        id: "482917364535",
        name: "Тип 2.1. Силуэт - выбрать ответ",
        title: "Тип 2.1",
        type: "2.1",
        video: { one: "", two: "" },
      },
      {
        id: "482917364536",
        name: "Тип 2.2. Контурный рисунок - выбрать ответ",
        title: "Тип 2.2",
        type: "2.2",
        video: { one: "", two: "" },
      },
      {
        id: "482917364537",
        name: "Тип 2.3. Вопрос из динамика - выбрать ответ",
        title: "Тип 2.3",
        type: "2.3",
        video: { one: "", two: "" },
      },
      {
        id: "482917364538",
        name: "Тип 2.4. Ответить на диалог - выбрать ответ",
        title: "Тип 2.4",
        type: "2.4",
        video: { one: "", two: "" },
      },
    ],
  },
  {
    id: "857392614380",
    name: "Тип 3. Перетащить ответ на медиа",
    title: "Тип 3",
    lesson: 3,
    children: [
      {
        id: "482978364534",
        name: "Тип 3.0. Вопрос по медиа - перетащить ответ",
        title: "Тип 3.0",
        type: "3.0",
        video: { one: "", two: "" },
      },
      {
        id: "482459364835",
        name: "Тип 3.1. Составить диалог - перетащить ответ",
        title: "Тип 3.1",
        type: "3.1",
        video: { one: "", two: "" },
      },
      {
        id: "485417365523",
        name: "Тип 3.2. Картинка / Анимация персонажей составить диалог - перетащить ответ",
        title: "Тип 3.2",
        type: "3.2",
        video: { one: "", two: "" },
      },
    ],
  },
  {
    id: "604182739561",
    name: "Тип 4. Переворачивать карточки, чтобы найти смежные варианты",
    title: "Тип 4",
    lesson: 4,
    children: [
      {
        id: "487867365523",
        name: "Тип 4.0. Переворачивать карточки, чтобы найти смежные варианты",
        title: "Тип 4.0",
        type: "4.0",
        video: { one: "", two: "" },
      },
    ],
  },
  {
    id: "729305184672",
    name: "Тип 5. Соединить правильные пары",
    title: "Тип 5",
    lesson: 5,
    children: [
      {
        id: "487867365524",
        name: "Тип 5.0. Соединить правильные пары",
        title: "Тип 5.0",
        type: "5.0",
        video: { one: "", two: "" },
      },
    ],
  },
];
