export const types = [
  {
    id: "482917364520",
    name: "Тип 1. Запись голоса пользователя",
    title: "Тип 1",
  },
  {
    id: "193847265019",
    name: "Тип 2. Выбор ответа из вариантов",
    title: "Тип 2",
  },
  {
    id: "857392614380",
    name: "Тип 3. Перетащить ответ на медиа",
    title: "Тип 3",
  },
  {
    id: "604182739561",
    name: "Тип 4. Переворачивать карточки, чтобы найти смежные варианты",
    title: "Тип 4",
  },
  {
    id: "729305184672",
    name: "Тип 5. Соединить правильные пары",
    title: "Тип 5",
  },
];
